<script setup>

</script>

<template>
  <section>
    <h2>Функциональные возможности</h2>
    <p>Наше приложение представляет собой мощный инструмент для интеграции и управления цифровыми ресурсами. Оно позволяет пользователям добавлять существующие сайты, базы данных и репозитории Git, обеспечивая централизованное управление проектами. Это значительно упрощает рабочие процессы и повышает эффективность командной работы.</p>
    <p>Одной из ключевых функций приложения является возможность создания дампов баз данных. Пользователи могут легко создавать резервные копии своих данных и загружать их на локальную машину. Это обеспечивает дополнительный уровень безопасности и позволяет быстро восстанавливать данные в случае необходимости.</p>
    <p>Кроме того, приложение поддерживает автоматизацию процессов, что позволяет пользователям настраивать регулярное создание дампов и их загрузку, минимизируя ручной труд и снижая вероятность ошибок.</p>
  </section><br>
  <section>
    <h2>Детальная страница сайта</h2>
    <p>На детальной странице каждого сайта, добавленного в приложение, доступна SSH консоль. Это мощный инструмент, который предоставляет пользователям возможность выполнять команды напрямую на сервере. SSH консоль обеспечивает полный контроль над управлением и настройкой серверных ресурсов, что особенно важно для опытных пользователей и системных администраторов.</p>
    <p>Консоль позволяет выполнять широкий спектр задач, от простых команд до сложных скриптов, что делает приложение универсальным инструментом для управления серверной инфраструктурой.</p>
  </section><br>
  <section>
    <h2>Доступы и управление</h2>
    <p>Для каждого сайта в приложении предоставляются детализированные доступы к серверу, репозиторию Git и базе данных. Это упрощает процесс администрирования и позволяет пользователям быстро находить необходимую информацию для управления своими проектами. Все доступы организованы в удобном интерфейсе, что делает управление проектами более интуитивным и эффективным.</p>
    <p>Пользователи могут легко обновлять и изменять доступы, что обеспечивает гибкость и адаптивность приложения под различные потребности и задачи.</p>
  </section><br>
  <section>
    <h2>Группировка сайтов</h2>
    <p>Приложение позволяет пользователям объединять сайты в группы. Это особенно полезно для организаций, работающих с большим количеством проектов, так как позволяет структурировать и организовывать ресурсы по категориям или другим критериям. Группировка сайтов упрощает навигацию и управление, позволяя пользователям быстро переключаться между проектами и находить нужные ресурсы.</p>
    <p>Кроме того, группировка позволяет назначать общие настройки и доступы для группы сайтов, что значительно экономит время и усилия при управлении большими проектами.</p>
  </section>
  <br><br>
  <p>&copy; 2025 AwtPanel. Все права защищены.</p>
</template>

<style scoped>
p{
  text-indent: 2em;
}
</style>